{
    "projects": [
        {
            "id": 1,
            "name": "TextMaster",
            "desc": "Welcome to TextMaster! Our powerful text processing tool offers a range of features to enhance your text manipulation experience. You can easily convert text to UPPER CASE or lower case, capitalize each word, count the number of words, and even calculate the time required to read it. Experience seamless and efficient text processing with TextMaster.",
            "image": "/assets/projects/textconverter.png",
            "tags": [
                "ReactJS",
                "Bootstrap "
            ],
            "Link": "https://text-master-coral.vercel.app",
            "gitLink":"https://github.com/mriganka528/Text-converter.git",
            "videoSrc":"/assets/projects/textMaster.mp4"
        },
        {
            "id": 2,
            "name": "MysticPulse",
            "desc": "Welcome to MysticPulse! MysticPulse is your gateway to anonymous connections. Create a unique profile link, share it with anyone, and let them send you anonymous messages. You have full control over your experience—turn your message receiving status on or off as you wish. Whether you're curious about what others think or just want to have fun, MysticPulse keeps the mystery alive. Discover the hidden pulse of your connections, all while staying in control of your privacy.",
            "image": "/assets/projects/MysticPulse.png",
            "tags": [
                "NextJS",
                "Tailwind",
                "ShadCN ",
                "Nodemailer"
            ],
            "Link": "https://mystic-pulse-theta.vercel.app/",
            "gitLink":"https://github.com/mriganka528/Mystery-message.git",
            "videoSrc":"/assets/projects/MysticPulse.mp4"

        },
        {
            "id": 3,
            "name": "InspireArt",
            "desc": "Welcome to AI InspireArt! Our cutting-edge platform harnesses the power of artificial intelligence to generate stunning images effortlessly. Whether you need unique visuals for your projects, custom artwork, or creative designs, AI InspireArt has you covered. Simply input your ideas, and let our AI bring them to life with remarkable precision and creativity. Experience the future of image generation with AI InspireArt.",
            "image": "/assets/projects/imageGenerator.png",
            "tags": [
                "ReactJS",
                "FetchAPI"
            ],
            "Link": "https://image-generator-flax.vercel.app/",
            "gitLink":"https://github.com/mriganka528/Image-generator.git",
            "videoSrc":"/assets/projects/inspireArt.mp4"

        },
        {
            "id": 4,
            "name": "Portfolio",
            "desc": "Welcome to my professional portfolio website! This site serves as a comprehensive showcase of my work as a full-stack developer. Here, you'll find detailed information about my skills, projects, and professional journey. The website is designed to provide a user-friendly experience, highlighting my ability to create responsive and dynamic web applications. Explore my portfolio to see how I bring ideas to life through innovative technology and design.",
            "image": "/assets/projects/portfolio.png",
            "tags": [
                "NextJS",
                "Typescript",
                "ShadCN",
                "Tailwind",
                "Nodemailer"
            ],
            "Link": "https://my-portfolio-delta-nine-43.vercel.app/",
            "gitLink":"https://github.com/mriganka528/portfolio.git",
            "videoSrc":"/assets/projects/portfolio.mp4"
        },
        {
            "id": 5,
            "name": "TaskVault",
            "desc": "Our comprehensive task management website is designed to help you organize and prioritize your tasks effortlessly. With features that allow you to create, edit, and delete tasks, set deadlines, and track your progress, TaskMaster ensures you stay on top of your to-do list. Our intuitive interface and secure login system make task management a breeze. Achieve your goals and boost your productivity. ",
            "image": "/assets/projects/taskVault.png",
            "tags": [
                "ReactJS",
                "Tailwind",
                "Redux"
            ],
            "Link": "https://task-vault-zeta.vercel.app",
            "gitLink":"https://github.com/mriganka528/TaskVault.git",
            "videoSrc":"/assets/projects/taskVault.mp4"
        },
        {
            "id": 6,
            "name": "NoteCraft",
            "desc": "Welcome to NoteCraft! Our innovative notebook website allows you to securely store your notes in the cloud, ensuring they are accessible anytime, anywhere. With robust login and sign-up features, your data is protected and private. NoteCraft also offers seamless functionality to add, edit, and delete notes, making it the perfect tool for all your note-taking needs. Experience secure and efficient note management with Notecraft.",
            "image": "/assets/projects/notecraft.png",
            "tags": [
                "ReactJs",
                "NodeJs",
                "ExpressJS",
                "MongoDB",
                "Bootstrap "
            ],
            "Link": "https://notecraft-front.vercel.app",
            "gitLink":"https://github.com/mriganka528/Notecraft-front.git",
            "videoSrc":"/assets/projects/noteCraft.mp4"
        },
        {
            "id": 7,
            "name": "BeatVault(Frontend Website)",
            "desc": " Discover and enroll in expertly crafted music courses designed to elevate your skills. Whether you're a beginner or an advanced musician, our courses cover a wide range of instruments and genres, taught by professional instructors. Start your musical journey today with MusicCoursePro and unlock your full potential.",
            "image": "/assets/projects/musiccourse.png",
            "tags": [
                "NextJS",
                "Typescript",
                "ShadCN ",
                "Tailwind"
            ],
            "Link": "https://beat-boulevard.vercel.app/",
            "gitLink":"https://github.com/mriganka528/Beat-boulevard.git",
            "videoSrc":"/assets/projects/musicCrs.mp4"
        }
    ]
}